import sys

def translit(text):
    cyrillic_to_latin = {
        'а': 'a',         'б': 'b',        'в': 'v',        'г': 'h',        'ґ': 'g',
        'д': 'd',        'е': 'e',        'є': 'ie',        'ж': 'zh',        'з': 'z',
        'и': 'y',        'і': 'i',        'ї': 'i',        'й': 'i',        'к': 'k',
        'л': 'l',        'м': 'm',        'н': 'n',        'о': 'o',        'п': 'p',
        'р': 'r',        'с': 's',        'т': 't',        'у': 'u',        'ф': 'f',
        'х': 'kh',        'ц': 'ts',        'ч': 'ch',        'ш': 'sh',        'щ': 'shch',
        'ь': '_',        'ъ': '_',        'ю': 'iu',        'я': 'ia',        'А': 'A',
        'Б': 'B',        'В': 'V',        'Г': 'H',        'Ґ': 'G',        'Д': 'D',
        'Е': 'E',        'Є': 'Ie',        'Ж': 'Zh',        'З': 'Z',        'И': 'Y',
        'І': 'I',        'Ї': 'I',        'Й': 'I',        'К': 'K',        'Л': 'L',
        'М': 'M',        'Н': 'N',        'О': 'O',        'П': 'P',        'Р': 'R',
        'С': 'S',        'Т': 'T',        'У': 'U',        'Ф': 'F',        'Х': 'Kh',
        'Ц': 'Ts',        'Ч': 'Ch',        'Ш': 'Sh',        'Щ': 'Shch',        'Ь': '_',
        'Ъ': '_',        'Ю': 'Iu',        'Я': 'Ia', 'Ñ':'N' , ' ':'_', '«':'_', '»':'_',
        '"':'_', '\u0096':'', '\u0094':''
    }
    for key in cyrillic_to_latin.keys():
        text = text.replace(key, cyrillic_to_latin[key])
    return text


print(translit(sys.argv[1]))